[
    {
        "language": "english",
        "length": "shorter",
        "content": "SZCH (pronounced [ʃt͡ɕ]) is a Zagreb-based DJ and producer from Istria. His high-energy, genre-shifting sets lean into internet humor, sharp left turns, and sudden BPM pivots.<br><br>He has performed across Europe and appeared on NTS and Red Light Radio. He formerly co-founded the Low Income Squad collective and later founded Value, a Zagreb project highlighting talent in music, art, and photography."
    },
    {
        "language": "english",
        "length": "longer",
        "content": "SZCH (pronounced [ʃt͡ɕ]) is a DJ and producer from the Istrian peninsula, now based in Zagreb, Croatia. Part of a new wave of Croatian artists, his high-energy sets bend genres and fold in internet microculture humor, with distinctive mixing and quick, unexpected BPM shifts. Selections range from UK hardcore to garage-tinged hyperpop and beyond.<br><br>He has performed across Europe, including Germany, France, Ukraine, the Netherlands, Switzerland, the UK, and Poland, and appeared on NTS, Balamii, AAJA Deptford, Red Light Radio, Operator, Berlin Community Radio, and LYL. His work has been supported by artists such as Objekt, Shanti Celeste, rRoxymore, Ross From Friends, Baltra, and Charlie Bones.<br><br>As an organizer and curator, he formerly co-founded the Low Income Squad collective. He also founded Value, a Zagreb-based project that bridges online and IRL spaces—spotlighting music, art, and photography through club nights, live shows, and exhibitions."
    },
    {
        "language": "croatian",
        "length": "shorter",
        "content": "SZCH (izgovara se [ʃt͡ɕ]) je DJ i producent iz Istre sa sjedištem u Zagrebu. Setovi su mu energični i žanrovski razigrani, s dozom internetskog humora i brzim, iznenadnim promjenama tempa.<br><br>Nastupao je širom Europe te gostovao na postajama poput NTS-a i Red Light Radija. Ranije je suosnovao kolektiv Low Income Squad te je potom pokrenuo zagrebački projekt Value koji predstavlja autore iz glazbe, umjetnosti i fotografije."
    },
    {
        "language": "croatian",
        "length": "longer",
        "content": "SZCH (izgovara se [ʃt͡ɕ]) je DJ i producent iz Istre, trenutno u Zagrebu. Dio je nove generacije domaćih izvođača; njegovi su setovi brzi, žanrovski otvoreni i često donose neočekivane rezove i promjene tempa. Raspon ide od UK hardcorea do hyperpopa s garage prizvukom.<br><br>Nastupao je širom Europe, uključujući Njemačku, Francusku, Ukrajinu, Nizozemsku, Švicarsku, Ujedinjeno Kraljevstvo i Poljsku, te se pojavio na NTS-u, Balamii, AAJA Deptfordu, Red Light Radiu, Operatoru, Berlin Community Radiu i LYL-u. Njegov rad pratili su izvođači poput Objekta, Shanti Celeste, rRoxymore, Ross From Friendsa, Baltre i Charlieja Bonesa.<br><br>Kao organizator i kurator, ranije je suosnovao kolektiv Low Income Squad. Pokrenuo je i Value - zagrebački projekt koji kroz klupske večeri, live nastupe i izložbe povezuje online i fizičke prostore te ističe autore iz glazbe, umjetnosti i fotografije."
    }
]
