[
    {
        "language": "english",
        "length": "shorter",
        "content": "SZCH (pronounced [ʃt͡ɕ]) is a Zagreb-based DJ and producer from the Istrian peninsula. Known for his high-energy, genre-blending sets infused with meme and online microculture-inspired humor, he crosses traditional boundaries with unique mixing techniques and unexpected BPM changes.<br><br>An autodidact, SZCH has performed across Europe and appeared on platforms like NTS Radio and Red Light Radio. He is also the founder of Value, a Zagreb-based project spotlighting talent in music, art, and photography."
    },
    {
        "language": "english",
        "length": "longer",
        "content": "SZCH (pronounced [ʃt͡ɕ]) is a DJ and producer from the Istrian peninsula, now based in Zagreb, Croatia. Part of the new generation of Croatian artists, his high-energy sets blend genres and are infused with meme and online microculture-inspired humor. As an autodidact, SZCH distinguishes himself with unique mixing techniques, unexpected BPM changes, and eclectic selections ranging from UK hardcore to Japanese garage-flavored hyperpop.<br><br>He has performed across Europe—including Germany, France, Ukraine, the Netherlands, Switzerland, the UK, and Poland—and appeared on platforms like Red Light Radio, Operator, Berlin Community Radio, Balamii, NTS Radio, and LYL. His work has caught the attention of notable artists such as Objekt, rRoxymore, Ross From Friends, Peggy Gou, Baltra, and Charlie Bones.<br><br>SZCH is also the founder of Value, a Zagreb-based project with global reach that focuses on the club community. Value bridges online and physical spaces, spotlighting talent in music, art, and photography through club nights, live performances, and exhibitions, fostering a space for creative expression and community connection."
    },
    {
        "language": "croatian",
        "length": "shorter",
        "content": "SZCH (izgovara se [ʃt͡ɕ]) je DJ i producent iz Istre, trenutno lociran u Zagrebu. Poznat po svojim energičnim, žanrovski miješanim setovima prožetim humorom inspiriranim memeovima i online mikrokulturom, prelazi tradicionalne granice uz jedinstvene tehnike miksanja i neočekivane promjene BPM-a.<br><br>Kao autodidakt, SZCH je nastupao diljem Europe i pojavljivao se na platformama poput NTS Radio i Red Light Radio. Također je osnivač Value, zagrebačkog projekta koji ističe talente u glazbi, umjetnosti i fotografiji."
    },
    {
        "language": "croatian",
        "length": "longer",
        "content": "SZCH (izgovara se [ʃt͡ɕ]) je DJ i producent iz Istre, trenutno lociran u Zagrebu. Pripadajući novoj generaciji hrvatskih umjetnika, njegovi energični setovi spajaju žanrove i prožeti su humorom inspiriranim memeovima i online mikrokulturom. Kao autodidakt, SZCH se ističe jedinstvenim tehnikama miksanja, neočekivanim promjenama BPM-a i eklektičnim izborom koji seže od UK hardcorea do japanskog hyperpopa s garage prizvukom.<br><br>Nastupao je diljem Europe—uključujući Njemačku, Francusku, Ukrajinu, Nizozemsku, Švicarsku, Ujedinjeno Kraljevstvo i Poljsku—i pojavljivao se na platformama poput Red Light Radio, Operator, Berlin Community Radio, Balamii, NTS Radio i LYL. Njegov rad privukao je pažnju istaknutih umjetnika poput Objekta, rRoxymore, Ross From Friends, Peggy Gou, Baltre i Charlieja Bonesa.<br><br>SZCH je također osnivač Value, zagrebačkog projekta s globalnim dosegom koji se fokusira na klupsku zajednicu. Value povezuje online i fizičke prostore, ističući talente u glazbi, umjetnosti i fotografiji kroz klupske večeri, live nastupe i izložbe, stvarajući prostor za kreativno izražavanje i povezivanje zajednice."
    }
]
